In [1]:
import sqlite3
import pandas as pd

def run_sql(query: str, db_path: str = "data/challenges.db") -> pd.DataFrame:
    """
    Executes a SQL query on the specified SQLite database and returns the result as a DataFrame.

    Args:
        query (str): SQL query to run.
        db_path (str): Path to the SQLite database file.

    Returns:
        pd.DataFrame: Result of the SQL query.
    """
    try:
        conn = sqlite3.connect(db_path)
        df = pd.read_sql_query(query, conn)
        conn.close()
        return df
    except Exception as e:
        print(f"‚ùå Error running query: {e}")
        return pd.DataFrame()

In [2]:
df = run_sql("SELECT name FROM customers WHERE country = 'Germany';")
df

            name
0   Anna Schultz
1    Lukas Meier
2     Elena Roth
3     Marco Beck
4  Klara Mueller

In [3]:
df = run_sql("SELECT name FROM customers WHERE signup_date > '2023-01-01';")
df

            name
0       John Doe
1     Elena Roth
2     Marco Beck
3  Klara Mueller